<?
// Debug
$debug = True;

// MySQL connect
$sqlserver = 0; // current db connection

// Sergey's PC
$dbuser[0] = "olimp";
$dbpass[0] = "asdzxc21";
$dbhost[0] = "178.74.197.11";
$dbname[0] = "olimpdb";

// Server
$dbname[1] = "olimpbiz_maindb";
$dbuser[1] = "olimpbiz_user";
$dbpass[1] = "gSDJgYJd";
$dbhost[1] = "localhost";

// configuration
define('SKIN', "default");
define('DEBUG', true);
define('DOCUMENT_ROOT', $_SERVER['DOCUMENT_ROOT']); //.'/tool');
define('ROOT_FOLDER', '');
// Email and Name for Problem List Mailer
define('TO_MAIL', $_SERVER['SERVER_ADMIN']);
define('TO_NAME', $_SERVER['SERVER_NAME']);


// system configure - no change, please!
$sys['lists'] = array(
'typesner' => array('','квартира','будинок','ділянка','комерційна',''=>'квартира','kva'=>'квартира','dom'=>'будинок','dil'=>'ділянка','com'=>'бізнес об\'єкт'),
'valutes' => array('','грн.','у. о.','євро'),
'actions' => array('Здається ','Продається '),
'kkimn' => array('','-1'=>'частина квартири','1-кімнатна','2-кімнатна','3-кімнатна','4-кімнатна','99'=>'Багатокімнатна'),
'typeskva'	=> array('Виберіть','розд. кімнати','зміж. кімнати','з/р кімнати ','гостинка ','студія','двохрівнева','багаторівнева','пентхауз'),
'stinykva'	=> array('монолітно-каркасні','панельні','монолітні','цегла(червона)','цегла(силикатна)','з утеплювачем','',''),
'stankva' => array('0'=>'Виберіть','-2'=>'без вн. робіт','-1'=>'іде ремонт','1'=>'штукатурка','2'=>'поганий','3'=>'нормальний','4'=>'гарний','5'=>'відмінний'),
'plo_od'	=> array('га.','соток'),
'sanuzel'	=> array(0=>'Виберіть',-2=>'окремо',-1=>'суміжний',2=>'2',3=>'3',4=>'4',5=>'5'),
'kva_inkva' => array('телефон','склопакети','вільне планування','кухня-студія','броньовані двері','видова','кондеціонер(и)','сигналізація','відеоспостереження','домофон','теплі пiдлоги','камін','лічильник води','газова колонка','бойлер','пральна машина','джакузі','сауна','кабельне ТБ','супутникове ТБ','інтернет','вбуд. кухня','меблі','імп. сантехніка','комп\'ютер','дом.кінотеатр','телевізор','холодильник','посудомийка','паркет','індив. опалення'),
'kva_indom' => array('техповерх','підвал','кап.ремонт','ліфт','газ','сміттєпровід','охорона','кодовий замок','автоном.котельня','парковка','поруч транспорт','тихе місце','авто.стоянка'),
'kva_domtype'	=> array('Виберіть','новобудова','"чешка"','"сталінка"','"хрущовка"','покращений','малосімейка','комунальний','гуртожиток','"дореволюційний"','індивідуальний'),
'dom_domtype' => array('Виберіть','будинок','частина будинку','дача'),
'dom_sos' => array('Виберіть','під знесення','поганий','нормальний','гарний','відмінний'),
'TmSdch' => array('Виберіть','після 2000','1990-1999','1980-1989','1970-1979','1960-1969','1940-1959','довоєнний','дореволюційний'),
'Gotov' => array('Виберіть','100 % - жилий','без внутр. робіт','лише коробка','лише фундамент','90%','80%','70%','60%','50%','40%','30%','20%','10%'),
'komm' => array('в будинку','в перспективі','поблизу','криниця','свердловина','водопровід','туалет на ділянці','місцева','центральна','грубки','котел','центральне','газовий','електричний','центральний'),
'dom_stinu' => array('цегла червона','цегла силікатна','пінобетон','монолітний','ракушняк','зруб','дерево','сендвіч-панель','цегла облицювальна','"під шубою"','сайдинг','з утеплювачем','шифер','залізо','металочерепиця','ондулін','бітумна черепиця','черепиця','алюміній','мідь','горище'),
'dom_dop'=>array('гараж','підвал','тераса','басейн','склопакети','камін','теплі пiдлоги','сауна','більярд','тренажерний зал','телефон','інтернет','кабельне ТБ','супутникове ТБ','сигналізація','відеоспостереження','кондиціонери','меблі','телевізор','холодильник','посудомийка','пральна машина'),
'dom_indil' => array('басейн','дім для гостей','баня/сауна','госп. будівлі','літня кухня','огорожа','гараж','погріб','будинок охорони','бесідка','спортмайданчик','барбекю','садок','город','ліс','парк','ландшафтний дизайн','теплиця','своя водойма','вихід до річки','вихід до озера','вихід до моря','своя пристань','свій пляж'),
'dom_dod' => array('розвинена інфраструктура','мальовниче місце','асфальтована дорога','зручне трансп. положення','будинок введений в експлуатацію','дозвіл на будівництво','земля приватизована','можливе збільшення ділянки'),
'vlasn'	=> array('Виберіть','приватна','комунальна','державна','в оренді','колективна'),
'rTipC'	=> array('індивідуальна забудова','сільськогосподарське','будівництво багатоповерхівки','торгово-офісне','спортивно-розважальне','адміністративно-соціальне','виробничо-складське','гаражі-автостоянки-АЗС-СТО','заповідно-санітарне','садівництво','комерційне','сільськогосподарське(пай)'),
'dil_komm' => array('220v на ділянці','380v на ділянці','поблизу','на ділянці','в перспективі','поблизу','криниця','свердловина','центральне','туалет на ділянці','місцева','центральна'),
'dil_indil'	=> array('будівлі','буд-матеріали','фундамент','огорожа','садок','город','ліс','парк','ландшафтний дизайн','своя водойма','вихід до річки','вихід до озера','вихід до моря','своя пристань','свій пляж'),
'dil_pos'	=> array('поза населеним пунктом','в населеному пункті','в котеджному містечку','в дачному кооперативі'),
'dil_add'	=> array('можливе збільшення','мальовниче місце','асфальтова дорога','охороняється','фасадна','рівна','є будівельний проект','можлива зміна цільового призначення'),
'com_stan' => array('Виберіть','без оздоблення','iде ремонт','будiвельне оздоблення','поганий','задовiльний','хороший','вiдмiнний'),
'in_office' => array('сигнализацiя','iнтернет','комп\'ютерная розводка','кондицiонер(и)','склопакети','фасаднi вiкна','решiтки','роллери','окремий вхiд','фасадний вхiд','вхiд iз двору','можливiсть окр. входу','меблi','орг.технiка','мiнi-АТС','комп\'ютери'),
'office_type' => array('виберіть','бізнес-центр','гіпермаркет','торгово-офісний центр','торгово-розважальний комплекс','особняк','адміністративне приміщення','нежиле в жилом будинку','жилий фонд','жилий фонд в квартирному будинку','павільон','ангар','складське приміщення','кіоск','торгове місце','окремий будинок','окремий будинок(жилий фонд)','частина будинку','частина будинку(жилий фонд)'),
'class' => array('?','&nbsp; &nbsp; А','&nbsp; &nbsp; B','&nbsp; &nbsp; C','&nbsp; &nbsp; D','&nbsp; &nbsp; E'),
'in_office_dom' => array('підземна парковка','наземна парковка','столова в приміщенні','ліфт(и)','пропускна система','охорона','відеоспоостереження','ц. кондиціонування','поруч метро','гарна трансп. розв\'язка','розвинена інфрастр-ра','прохідне місце'),
'com_var' => array('торгiвля (продукти)','торгiвля (непродовольча група)','кафе, бари, ресторани i т.д.','побутовi послуги','медичнi послуги','спортивно-оздоровчi послуги','разважальнi послуги','готельнi послуги','автосервiс'),
'com_in_sklad' => array('торгiвельний зал','офiснi примiщення','складськi примiщення','сантех. блок','склопакети','вiтриннi вiкна','решiтки','роллери','окремий вхiд','фасадний вхiд','вхiд iз двору','можливiсть окр. входу'),
'planing' => array('кабінетна','офісна','вільна'),
'kuh' => array('в офісі','в блоці','на поверсі'),
'com_sanuzel' => array('в офісі','в блоці','на поверсі')
//''	=> array('',),
);
?>